module.eks.module.kms.data.aws_caller_identity.current[0]: Reading...
module.eks.module.eks_managed_node_group["eks_nodes"].data.aws_caller_identity.current: Reading...
module.eks.data.aws_caller_identity.current: Reading...
module.eks.module.eks_managed_node_group["eks_nodes"].data.aws_iam_policy_document.assume_role_policy[0]: Reading...
module.eks.module.eks_managed_node_group["eks_nodes"].data.aws_partition.current: Reading...
module.eks.data.aws_partition.current: Reading...
module.eks.aws_cloudwatch_log_group.this[0]: Refreshing state... [id=/aws/eks/my-netflix-eks/cluster]
aws_eip.nat[0]: Refreshing state... [id=eipalloc-0dc1c6a00f870c79e]
module.eks.module.eks_managed_node_group["eks_nodes"].data.aws_iam_policy_document.assume_role_policy[0]: Read complete after 0s [id=2560088296]
module.eks.data.aws_partition.current: Read complete after 0s [id=aws]
module.eks.module.eks_managed_node_group["eks_nodes"].data.aws_partition.current: Read complete after 0s [id=aws]
module.eks.module.kms.data.aws_partition.current[0]: Reading...
module.eks.data.aws_iam_policy_document.assume_role_policy[0]: Reading...
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-0fd683fe6965c3bcd]
module.eks.module.eks_managed_node_group["eks_nodes"].aws_iam_role.this[0]: Refreshing state... [id=eks_nodes-eks-node-group-20240707012604659200000001]
module.eks.module.kms.data.aws_partition.current[0]: Read complete after 0s [id=aws]
module.eks.data.aws_iam_policy_document.assume_role_policy[0]: Read complete after 0s [id=2764486067]
module.eks.aws_iam_role.this[0]: Refreshing state... [id=my-netflix-eks-cluster-20240707012604660400000002]
module.eks.data.aws_caller_identity.current: Read complete after 0s [id=767397667217]
module.eks.data.aws_iam_session_context.current: Reading...
module.eks.data.aws_iam_session_context.current: Read complete after 0s [id=arn:aws:iam::767397667217:root]
module.eks.module.kms.data.aws_caller_identity.current[0]: Read complete after 0s [id=767397667217]
module.eks.aws_iam_role_policy_attachment.this["AmazonEKSClusterPolicy"]: Refreshing state... [id=my-netflix-eks-cluster-20240707012604660400000002-20240707012605068600000006]
module.eks.aws_iam_role_policy_attachment.this["AmazonEKSVPCResourceController"]: Refreshing state... [id=my-netflix-eks-cluster-20240707012604660400000002-20240707012605041900000005]
module.eks.module.kms.data.aws_iam_policy_document.this[0]: Reading...
module.eks.module.kms.data.aws_iam_policy_document.this[0]: Read complete after 0s [id=3457105742]
module.eks.module.kms.aws_kms_key.this[0]: Refreshing state... [id=8d741591-703a-457d-9817-a9dac65051d3]
module.eks.module.eks_managed_node_group["eks_nodes"].data.aws_caller_identity.current: Read complete after 0s [id=767397667217]
module.eks.module.eks_managed_node_group["eks_nodes"].aws_iam_role_policy_attachment.this["AmazonEKSWorkerNodePolicy"]: Refreshing state... [id=eks_nodes-eks-node-group-20240707012604659200000001-20240707012605159000000007]
module.eks.module.eks_managed_node_group["eks_nodes"].aws_iam_role_policy_attachment.this["AmazonEC2ContainerRegistryReadOnly"]: Refreshing state... [id=eks_nodes-eks-node-group-20240707012604659200000001-20240707012604993400000004]
module.eks.module.eks_managed_node_group["eks_nodes"].aws_iam_role_policy_attachment.this["AmazonEKS_CNI_Policy"]: Refreshing state... [id=eks_nodes-eks-node-group-20240707012604659200000001-20240707012604951400000003]
module.eks.module.kms.aws_kms_alias.this["cluster"]: Refreshing state... [id=alias/eks/my-netflix-eks]
module.eks.aws_iam_policy.cluster_encryption[0]: Refreshing state... [id=arn:aws:iam::767397667217:policy/my-netflix-eks-cluster-ClusterEncryption20240707012627105600000011]
module.eks.aws_iam_role_policy_attachment.cluster_encryption[0]: Refreshing state... [id=my-netflix-eks-cluster-20240707012604660400000002-20240707012627296800000012]
module.vpc.aws_default_security_group.this[0]: Refreshing state... [id=sg-02bf663c74842214e]
module.vpc.aws_default_route_table.default[0]: Refreshing state... [id=rtb-066b0fe0dd66ae961]
module.vpc.aws_subnet.public[2]: Refreshing state... [id=subnet-0b6feb6393a1957b3]
module.vpc.aws_subnet.private[2]: Refreshing state... [id=subnet-03e3b84685adf9e8c]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-0602517d34d22a6af]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-096fd8b92db50c070]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-07aea62eedbbfee6a]
module.vpc.aws_default_network_acl.this[0]: Refreshing state... [id=acl-0afb298e6730ba77c]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-02c87b545c60783bc]
module.eks.aws_security_group.node[0]: Refreshing state... [id=sg-0e076e04fd6dc14e4]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-076bf7f4c2f892b4d]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-052a9eb9266bd4239]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-08a40c9334d1fa59d]
module.vpc.aws_route_table.private[1]: Refreshing state... [id=rtb-06af7ea698632bc54]
module.vpc.aws_route_table.private[2]: Refreshing state... [id=rtb-0256aef98c5c982bd]
module.eks.aws_security_group.cluster[0]: Refreshing state... [id=sg-0599fa218c2e99963]
module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-012290ea6a3bb57d6]
module.vpc.aws_nat_gateway.this[2]: Refreshing state... [id=nat-0fe3b8655270bfe4e]
module.vpc.aws_nat_gateway.this[1]: Refreshing state... [id=nat-0a127e8f2b9034a6f]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-0637b0a892cb42811]
module.vpc.aws_route_table_association.public[2]: Refreshing state... [id=rtbassoc-018ec9e5a5d3419b2]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-093a8fb4ebe7fb0d2]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-052a9eb9266bd42391080289494]
module.eks.aws_security_group_rule.cluster["ingress_nodes_443"]: Refreshing state... [id=sgrule-3502111232]
module.eks.aws_security_group_rule.node["ingress_cluster_9443_webhook"]: Refreshing state... [id=sgrule-2957780551]
module.eks.aws_security_group_rule.node["ingress_cluster_kubelet"]: Refreshing state... [id=sgrule-2278414809]
module.eks.aws_security_group_rule.node["ingress_nodes_ephemeral"]: Refreshing state... [id=sgrule-1113420281]
module.eks.aws_security_group_rule.node["ingress_self_coredns_tcp"]: Refreshing state... [id=sgrule-1821970920]
module.eks.aws_security_group_rule.node["ingress_cluster_443"]: Refreshing state... [id=sgrule-1192995246]
module.eks.aws_security_group_rule.node["ingress_self_coredns_udp"]: Refreshing state... [id=sgrule-3368464903]
module.eks.aws_security_group_rule.node["egress_all"]: Refreshing state... [id=sgrule-4168657880]
module.eks.aws_security_group_rule.node["ingress_cluster_4443_webhook"]: Refreshing state... [id=sgrule-250826299]
module.eks.aws_security_group_rule.node["ingress_cluster_6443_webhook"]: Refreshing state... [id=sgrule-3350276525]
module.eks.aws_security_group_rule.node["ingress_cluster_8443_webhook"]: Refreshing state... [id=sgrule-3572307340]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-062f6fd0e72b6f49a]
module.vpc.aws_route_table_association.private[2]: Refreshing state... [id=rtbassoc-0f2048895c551307d]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-0e41db5311d43b368]
module.eks.aws_eks_cluster.this[0]: Refreshing state... [id=my-netflix-eks]
module.eks.data.tls_certificate.this[0]: Reading...
module.eks.data.aws_eks_addon_version.this["kube-proxy"]: Reading...
module.eks.data.aws_eks_addon_version.this["coredns"]: Reading...
module.eks.data.aws_eks_addon_version.this["vpc-cni"]: Reading...
module.eks.data.aws_eks_addon_version.this["eks-pod-identity-agent"]: Reading...
module.eks.time_sleep.this[0]: Refreshing state... [id=2024-07-07T01:38:19Z]
module.eks.module.eks_managed_node_group["eks_nodes"].module.user_data.null_resource.validate_cluster_service_cidr: Refreshing state... [id=1793652533521047419]
module.eks.module.eks_managed_node_group["eks_nodes"].aws_launch_template.this[0]: Refreshing state... [id=lt-0b286fb934b08f5cf]
module.eks.data.aws_eks_addon_version.this["eks-pod-identity-agent"]: Read complete after 0s [id=eks-pod-identity-agent]
module.eks.data.aws_eks_addon_version.this["vpc-cni"]: Read complete after 0s [id=vpc-cni]
module.eks.data.aws_eks_addon_version.this["kube-proxy"]: Read complete after 0s [id=kube-proxy]
module.eks.module.eks_managed_node_group["eks_nodes"].aws_eks_node_group.this[0]: Refreshing state... [id=my-netflix-eks:eks_nodes-20240707013820420000000015]
module.eks.data.aws_eks_addon_version.this["coredns"]: Read complete after 0s [id=coredns]
module.eks.data.tls_certificate.this[0]: Read complete after 0s [id=9ce40dc2a049cbf871181c1b9ce87cb4fcc34109]
module.eks.aws_iam_openid_connect_provider.oidc_provider[0]: Refreshing state... [id=arn:aws:iam::767397667217:oidc-provider/oidc.eks.us-west-2.amazonaws.com/id/A1E8D570D974A405CFFE27FF5CE2E1F9]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.eks.module.eks_managed_node_group["eks_nodes"].aws_eks_node_group.this[0] has changed
  ~ resource "aws_eks_node_group" "this" {
      + arn                    = "arn:aws:eks:us-west-2:767397667217:nodegroup/my-netflix-eks/eks_nodes-20240707013820420000000015/a4c8456b-c66d-ba86-7de5-2e2d85805179"
        id                     = "my-netflix-eks:eks_nodes-20240707013820420000000015"
      + resources              = [
          + {
              + autoscaling_groups              = [
                  + {
                      + name = "eks-eks_nodes-20240707013820420000000015-a4c8456b-c66d-ba86-7de5-2e2d85805179"
                    },
                ]
                # (1 unchanged attribute hidden)
            },
        ]
      + status                 = "CREATE_FAILED"
        tags                   = {
            "Name" = "eks_nodes"
        }
        # (8 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
+/- create replacement and then destroy

Terraform will perform the following actions:

  # aws_eip.nat has moved to aws_eip.nat[0]
    resource "aws_eip" "nat" {
        id                       = "eipalloc-0dc1c6a00f870c79e"
        tags                     = {}
        # (18 unchanged attributes hidden)
    }

  # aws_eip.nat[1] will be created
  + resource "aws_eip" "nat" {
      + allocation_id        = (known after apply)
      + arn                  = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = (known after apply)
      + id                   = (known after apply)
      + instance             = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + ptr_record           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags_all             = (known after apply)
      + vpc                  = true
    }

  # aws_eip.nat[2] will be created
  + resource "aws_eip" "nat" {
      + allocation_id        = (known after apply)
      + arn                  = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = (known after apply)
      + id                   = (known after apply)
      + instance             = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + ptr_record           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags_all             = (known after apply)
      + vpc                  = true
    }

  # module.eks.aws_eks_addon.this["coredns"] will be created
  + resource "aws_eks_addon" "this" {
      + addon_name                  = "coredns"
      + addon_version               = "v1.11.1-eksbuild.8"
      + arn                         = (known after apply)
      + cluster_name                = "my-netflix-eks"
      + configuration_values        = (known after apply)
      + created_at                  = (known after apply)
      + id                          = (known after apply)
      + modified_at                 = (known after apply)
      + preserve                    = true
      + resolve_conflicts_on_create = "OVERWRITE"
      + resolve_conflicts_on_update = "OVERWRITE"
      + tags_all                    = (known after apply)

      + timeouts {}
    }

  # module.eks.aws_eks_addon.this["eks-pod-identity-agent"] will be created
  + resource "aws_eks_addon" "this" {
      + addon_name                  = "eks-pod-identity-agent"
      + addon_version               = "v1.3.0-eksbuild.1"
      + arn                         = (known after apply)
      + cluster_name                = "my-netflix-eks"
      + configuration_values        = (known after apply)
      + created_at                  = (known after apply)
      + id                          = (known after apply)
      + modified_at                 = (known after apply)
      + preserve                    = true
      + resolve_conflicts_on_create = "OVERWRITE"
      + resolve_conflicts_on_update = "OVERWRITE"
      + tags_all                    = (known after apply)

      + timeouts {}
    }

  # module.eks.aws_eks_addon.this["kube-proxy"] will be created
  + resource "aws_eks_addon" "this" {
      + addon_name                  = "kube-proxy"
      + addon_version               = "v1.30.0-eksbuild.3"
      + arn                         = (known after apply)
      + cluster_name                = "my-netflix-eks"
      + configuration_values        = (known after apply)
      + created_at                  = (known after apply)
      + id                          = (known after apply)
      + modified_at                 = (known after apply)
      + preserve                    = true
      + resolve_conflicts_on_create = "OVERWRITE"
      + resolve_conflicts_on_update = "OVERWRITE"
      + tags_all                    = (known after apply)

      + timeouts {}
    }

  # module.eks.aws_eks_addon.this["vpc-cni"] will be created
  + resource "aws_eks_addon" "this" {
      + addon_name                  = "vpc-cni"
      + addon_version               = "v1.18.1-eksbuild.3"
      + arn                         = (known after apply)
      + cluster_name                = "my-netflix-eks"
      + configuration_values        = (known after apply)
      + created_at                  = (known after apply)
      + id                          = (known after apply)
      + modified_at                 = (known after apply)
      + preserve                    = true
      + resolve_conflicts_on_create = "OVERWRITE"
      + resolve_conflicts_on_update = "OVERWRITE"
      + tags_all                    = (known after apply)

      + timeouts {}
    }

  # module.vpc.aws_nat_gateway.this[1] will be created
  + resource "aws_nat_gateway" "this" {
      + allocation_id                      = (known after apply)
      + association_id                     = (known after apply)
      + connectivity_type                  = "public"
      + id                                 = (known after apply)
      + network_interface_id               = (known after apply)
      + private_ip                         = (known after apply)
      + public_ip                          = (known after apply)
      + secondary_private_ip_address_count = (known after apply)
      + secondary_private_ip_addresses     = (known after apply)
      + subnet_id                          = "subnet-096fd8b92db50c070"
      + tags                               = {
          + "Environment" = "Production"
          + "Name"        = "my-netflix-vpc"
        }
      + tags_all                           = {
          + "Environment" = "Production"
          + "Name"        = "my-netflix-vpc"
        }
    }

  # module.vpc.aws_nat_gateway.this[2] will be created
  + resource "aws_nat_gateway" "this" {
      + allocation_id                      = (known after apply)
      + association_id                     = (known after apply)
      + connectivity_type                  = "public"
      + id                                 = (known after apply)
      + network_interface_id               = (known after apply)
      + private_ip                         = (known after apply)
      + public_ip                          = (known after apply)
      + secondary_private_ip_address_count = (known after apply)
      + secondary_private_ip_addresses     = (known after apply)
      + subnet_id                          = "subnet-0b6feb6393a1957b3"
      + tags                               = {
          + "Environment" = "Production"
          + "Name"        = "my-netflix-vpc"
        }
      + tags_all                           = {
          + "Environment" = "Production"
          + "Name"        = "my-netflix-vpc"
        }
    }

  # module.vpc.aws_route.private_nat_gateway[0] will be created
  + resource "aws_route" "private_nat_gateway" {
      + destination_cidr_block = "0.0.0.0/0"
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + nat_gateway_id         = "nat-012290ea6a3bb57d6"
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = "rtb-08a40c9334d1fa59d"
      + state                  = (known after apply)

      + timeouts {
          + create = "5m"
        }
    }

  # module.vpc.aws_route.private_nat_gateway[1] will be created
  + resource "aws_route" "private_nat_gateway" {
      + destination_cidr_block = "0.0.0.0/0"
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + nat_gateway_id         = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = "rtb-06af7ea698632bc54"
      + state                  = (known after apply)

      + timeouts {
          + create = "5m"
        }
    }

  # module.vpc.aws_route.private_nat_gateway[2] will be created
  + resource "aws_route" "private_nat_gateway" {
      + destination_cidr_block = "0.0.0.0/0"
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + nat_gateway_id         = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = "rtb-0256aef98c5c982bd"
      + state                  = (known after apply)

      + timeouts {
          + create = "5m"
        }
    }

  # module.eks.module.eks_managed_node_group["eks_nodes"].aws_eks_node_group.this[0] is tainted, so must be replaced
+/- resource "aws_eks_node_group" "this" {
      ~ arn                    = "arn:aws:eks:us-west-2:767397667217:nodegroup/my-netflix-eks/eks_nodes-20240707013820420000000015/a4c8456b-c66d-ba86-7de5-2e2d85805179" -> (known after apply)
      ~ capacity_type          = "ON_DEMAND" -> (known after apply)
      ~ disk_size              = 0 -> (known after apply)
      ~ id                     = "my-netflix-eks:eks_nodes-20240707013820420000000015" -> (known after apply)
      - labels                 = {} -> null
      ~ node_group_name        = "eks_nodes-20240707013820420000000015" -> (known after apply)
      ~ release_version        = "1.30.0-20240625" -> (known after apply)
      ~ resources              = [
          - {
              - autoscaling_groups              = [
                  - {
                      - name = "eks-eks_nodes-20240707013820420000000015-a4c8456b-c66d-ba86-7de5-2e2d85805179"
                    },
                ]
                # (1 unchanged attribute hidden)
            },
        ] -> (known after apply)
      ~ status                 = "CREATE_FAILED" -> (known after apply)
        tags                   = {
            "Name" = "eks_nodes"
        }
        # (8 unchanged attributes hidden)

      ~ launch_template {
            id      = "lt-0b286fb934b08f5cf"
          ~ name    = "eks_nodes-20240707013819743300000013" -> (known after apply)
            # (1 unchanged attribute hidden)
        }

      ~ update_config {
          - max_unavailable            = 0 -> null
            # (1 unchanged attribute hidden)
        }

        # (2 unchanged blocks hidden)
    }

Plan: 12 to add, 0 to change, 1 to destroy.

Warning: Argument is deprecated

  with aws_eip.nat,
  on main.tf line 17, in resource "aws_eip" "nat":
  17:   vpc   = true

use domain attribute instead

(and 3 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

<!-- Sticky Pull Request Comment -->